{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Populist_narrative",
    "1": "Nativist_narrative",
    "2": "Denialist_narrative",
    "3": "Declinist_narrative",
    "4": "Apocalyptist_narrative",
    "5": "Revisionist_narrative"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "Populist_narrative": 0,
    "Nativist_narrative": 1,
    "Denialist_narrative": 2,
    "Declinist_narrative": 3,
    "Apocalyptist_narrative": 4,
    "Revisionist_narrative": 5
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.11.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 42774
}
